In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

data = pd.read_csv('data/pd-move_cost.csv')
data.head()

,City,Cappuccino,Cinema,Wine,Gasoline,Avg Rent,Avg Disposable Income
0,Lausanne,3.15,12.59,8.40,1.32,1714.00,4266.11
1,Zurich,3.28,12.59,8.40,1.31,2378.61,4197.55
2,Geneva,2.80,12.94,10.49,1.28,2607.95,3917.72
3,Basel,3.50,11.89,7.35,1.25,1649.29,3847.76
4,Perth,2.87,11.43,10.08,0.97,2083.14,3358.55

### Find out the Places where Cappuccino is Least and Most Expensive

In [2]:
data[['City','Cappuccino']].sort_values(by = 'Cappuccino', ascending = True).head().reset_index(drop = True)  # Very Cheap
data[['City','Cappuccino']].sort_values(by = 'Cappuccino', ascending = False).head().reset_index(drop = True) # Most Expensive

         City  Cappuccino
0   Stavanger        4.48
1      Bergen        3.92
2   Nashville        3.84
3   Trondheim        3.81
4  Copenhagen        3.66

### Find out the Places where Cinema is Least and Most Expensive

In [3]:
data[['City','Cinema']].sort_values(by = 'Cinema', ascending = True).head().reset_index(drop = True)  # Very Cheap
data[['City','Cinema']].sort_values(by = 'Cinema', ascending = False).head().reset_index(drop = True) # Most Expensive

       City  Cinema
0    Riyadh   79.49
1  Brighton   14.95
2    Geneva   12.94
3  Lausanne   12.59
4    Zurich   12.59

### Find out the Places where Rent is Least and Most Expensive

In [4]:
print(data[['City','Avg Rent']].sort_values(by = 'Avg Rent', ascending = True).head().reset_index(drop = True))
print(data[['City','Avg Rent']].sort_values(by = 'Avg Rent', ascending = False).head().reset_index(drop = True))

        City  Avg Rent
0   Vadodara    120.68
1      Kochi    181.02
2  Ahmedabad    193.08
3    Karachi    197.78
4     Indore    205.15
        City  Avg Rent
0  Hong Kong   5052.31
1   New York   3268.84
2  Singapore   3164.42
3     Sydney   2788.71
4     Geneva   2607.95